In [1]:
import pandas as pd

In [2]:
temperature = pd.DataFrame({
    "city":["Mumbai","Pune","Banglore"],
    "temperature":[7,12,20]
})
temperature

       city  temperature
0    Mumbai            7
1      Pune           12
2  Banglore           20

In [3]:
humidity = pd.DataFrame({
    "city":["Mumbai","Pune","Banglore"],
    "humidity":[13,10,15]
})
humidity

       city  humidity
0    Mumbai        13
1      Pune        10
2  Banglore        15

In [5]:
df = pd.merge(temperature,humidity,on="city")

In [6]:
df

       city  temperature  humidity
0    Mumbai            7        13
1      Pune           12        10
2  Banglore           20        15

In [7]:
temperature = pd.DataFrame({
    "city":["Mumbai","Pune","Banglore","Nasik"],
    "temperature":[7,12,20,34]
})
temperature

       city  temperature
0    Mumbai            7
1      Pune           12
2  Banglore           20
3     Nasik           34

In [8]:
humidity = pd.DataFrame({
    "city":["Mumbai","Agra","Banglore"],
    "humidity":[13,10,15]
})
humidity

       city  humidity
0    Mumbai        13
1      Agra        10
2  Banglore        15

In [9]:
df = pd.merge(temperature,humidity,on="city")

In [10]:
df

       city  temperature  humidity
0    Mumbai            7        13
1  Banglore           20        15

In [11]:
df = pd.merge(temperature,humidity,on="city",how="outer")

In [12]:
df

       city  temperature  humidity
0    Mumbai          7.0      13.0
1      Pune         12.0       NaN
2  Banglore         20.0      15.0
3     Nasik         34.0       NaN
4      Agra          NaN      10.0

In [13]:
df = pd.merge(temperature,humidity,on="city",how="left")

In [14]:
df

       city  temperature  humidity
0    Mumbai            7      13.0
1      Pune           12       NaN
2  Banglore           20      15.0
3     Nasik           34       NaN

In [15]:
df = pd.merge(temperature,humidity,on="city",how="right")
df

       city  temperature  humidity
0    Mumbai          7.0        13
1  Banglore         20.0        15
2      Agra          NaN        10

In [16]:
df = pd.merge(temperature,humidity,on="city",how="outer",indicator=True)
df

       city  temperature  humidity      _merge
0    Mumbai          7.0      13.0        both
1      Pune         12.0       NaN   left_only
2  Banglore         20.0      15.0        both
3     Nasik         34.0       NaN   left_only
4      Agra          NaN      10.0  right_only

In [17]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35,38],
    "humidity": [65,68,71, 75]
})
df1

        city  temperature  humidity
0   new york           21        65
1    chicago           14        68
2    orlando           35        71
3  baltimore           38        75

In [18]:

df2 = pd.DataFrame({
    "city": ["chicago","new york","san diego"],
    "temperature": [21,14,35],
    "humidity": [65,68,71]
})
df2

        city  temperature  humidity
0    chicago           21        65
1   new york           14        68
2  san diego           35        71

In [19]:
df = pd.merge(df1,df2,on="city")

In [20]:
df

       city  temperature_x  humidity_x  temperature_y  humidity_y
0  new york             21          65             14          68
1   chicago             14          68             21          65

In [21]:
df = pd.merge(df1,df2,on="city",suffixes=["_left","_right"])
df

,city,temperature_left,humidity_left,temperature_right,humidity_right
0,new york,21,65,14,68
1,chicago,14,68,21,65